---
title: "11wk-2: [DataFrame] -- 타이타닉, Pandas 문법 (1)"
author: "최규빈"
date: "05/15/2025"
draft: false
---

In [96]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## 타이타닉

### A. 영화

![](https://i.namu.wiki/i/NvEDz4YsYDjJ9jYS4K7qv8Eo5rkAEvX5MbZ72SrvdseDvrKwpYS0SN9CvH4DfEQR9SMLXtSZBo3-LXCgFnUFwSt2GIbhp1RiwdpxuOjrIVIXNpK9e6L3kgNdXmlHWXnQmIjXvJv38DlOaPiSu5wDDg.webp)

ref: <https://namu.wiki/w/타이타닉(영화)>

### B. 데이터

`-` 데이터 불러오기

In [97]:
df = pd.read_csv("https://raw.githubusercontent.com/guebin/IAB2025-Play/refs/heads/main/content/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

`# 예제1` -- 단순계산

`(1)` 전체 탑승객은 몇명인가?

`(2)` 전체 탐승객중 몇명이 생존하였는가?

`(3)` 생존률을 구하라.

`(4)` 탑승객중 남자는 몇명, 여자는 몇명인가?

`(5)` 남자와 여자의 비율은?

`(6)` 탑승객이 탑승한 항구는 몇 종류인가? 종류별로 몇명의 승객이 탑승했는가?

`#`

`# 예제2` -- 그룹별 생존률

`(1)` 남녀의 생존률을 각각 구하고 비교하라.

`(2)` 항구별 생존률을 각각 구하고 비교하라.

`(3)` 항구별 Fare를 각각 구하고 비교하라.

`#`

`# 예제3` -- 시각화

`(1)` Age에 대한 히스토그림을 그려라.

`(2)` 성별로 Age에 대한 히스토그램을 그려라.

`(3)` 항구별/성별로 Age에 대한 히스토그램을 그려라.

`#`

`# 예제4` -- 그룹별 생존률

`(1)` 10세 미만 승객의 생존률을 구하라.

`(2)` 20대 남자의 생존률을 구하라.

## Pandas 문법 (1)

### df 만들기

In [112]:
dct = {'date': ['12/30','12/31','01/01','01/02','01/03'], 'X1': [65,95,65,55,80], 'X2': [55,100,90,80,30], 'X3': [50,50,60,75,30], 'X4': [40,80,30,80,100]}
df = pd.DataFrame(dct) 
df

    date  X1   X2  X3   X4
0  12/30  65   55  50   40
1  12/31  95  100  50   80
2  01/01  65   90  60   30
3  01/02  55   80  75   80
4  01/03  80   30  30  100

### 열의 선택

`-` 방법1 -- `df.`

In [91]:
# df.X1

`-` 방법2 -- `df[]`

In [138]:
# df['X1'] # str 
# df[['X1']] # [str]
# df[['X1','X3']] # [str,str]

`-` 방법3 -- `df.iloc`

In [175]:
# df.iloc[:,0] # int
# df.iloc[:,-2:] # int:int - 슬라이싱
# df.iloc[:,1::2] # int:int - 스트라이딩
# df.iloc[:,[0]] # [int]
# df.iloc[:,[0,1]] # [int,int]
# df.iloc[:,[True,True,False,False]] # bool의 list 
# df.iloc[:,range(2)] # range

`-` 방법4 -- `df.loc`

In [109]:
# df.loc[:,'X1'] # str
# df.loc[:,'X1':'X3'] # 'str':'str' -- 칼럼이름으로 슬라이싱 **
# df.loc[:,'X1'::2] # 'str':'str' -- 칼럼이름으로 스트라이딩 ** 
# df.loc[:,['X1']] # [str]
# df.loc[:,['X1','X4']] # [str,str]
# df.loc[:,[True,False,False,True]] # bool의 list

### 행의 선택

`-` 방법1 -- `df[]`

In [93]:
# df[:2] # int:int -- 슬라이싱 // df.iloc[:2,:], df.iloc[:2] 와 같음
# df[::2] # int:int -- 스트라이딩 
# df[['12' in date for date in df.date]] # [bool,bool]
# df[df.X1 < 70] # pd.Series([bool,bool])

`-` 방법2 -- `df.loc`

In [94]:
# df.iloc[0] # int 
# df.iloc[-2:] # int:int -- 슬라이싱
# df.iloc[1::2] # int:int -- 스트라이딩
# df.iloc[[0]] # [int]
# df.iloc[[0,1]] # [int,int]
# df.iloc[['12' in date for date in df.date]] # [bool,bool]
# df.iloc[range(2)] # range

In [92]:
# df.iloc[0,:] # int 
# df.iloc[-2:,:] # int:int -- 슬라이싱
# df.iloc[1::2,:] # int:int -- 스트라이딩
# df.iloc[[0],:] # [int]
# df.iloc[[0,1],:] # [int,int]
# df.iloc[['12' in date for date in df.date],:] # [bool,bool]
# df.iloc[range(2),:] # range

`-` 방법3 -- `df.iloc`

In [95]:
# df.loc[0] # int 
# df.loc[:2] # int:int 
# df.loc[[0,1]] # [int,int]
# df.loc[['12' in date for date in df.date]] # [bool,bool]
# df.loc[df.X1>70] # pd.Series([bool,bool])